{"backend": "tensorflow", "config": {"layers": [{"config": {"embeddings_regularizer": null, "embeddings_constraint": null, "input_length": 20, "name": "embedding_1", "input_dim": 2789, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "output_dim": 32, "batch_input_shape": [null, 20], "trainable": true, "mask_zero": false, "dtype": "float32"}, "class_name": "Embedding"}, {"config": {"padding": "same", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv1d_1", "bias_regularizer": null, "dilation_rate": [1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "strides": [1], "bias_constraint": null, "kernel_size": [3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 32}, "class_name": "Conv1D"}, {"config": {"padding": "valid", "data_format": "channels_last", "strides": [2], "name": "max_pooling1d_1", "pool_size": [2], "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"return_sequences": false, "bias_constraint": null, "go_backwards": false, "unroll": false, "recurrent_constraint": null, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "trainable": true, "use_bias": true, "units": 256, "implementation": 1, "return_state": false, "recurrent_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "units": 2789, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "softmax", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4"}